# Іменник
# Колір
# Дієслово
# Назва тварини
# Назва місця
#
#
#  І видаємо текст, де замість квадратних дужок — слова, введені користувачем:
#
# Одного разу [Іменник] був дуже сумний, тому що він був [Колір].
# Він вирішив [Дієслово] у [Назва місця], де зустрів [Назва тварини]. Разом вони вирішили залишитися в [Назва місця] назавжди, і стали найкращими друзями.
noun = input("Введіть іменник")
color = input("Введіть колір")
verb = input("Введіть дієслово")
animal = input("Введіть назва тварини")
city = input("Введіть назва місця")
print("Одного разу", noun, "був дуже сумний, тому що він був", color,
"Він вирішив" ,verb,  "y", city, "- де зустрів", animal," Разом вони вирішили залишитися в", city, "назавжди, і стали найкращими друзями.")





