weather = input("Яка сьогодні погода? (сонячно, хмарно, сніг, дощ ):")

if weather == "сонячно":
    print("тапки,футболка,шорти,кепка,сумка")
elif weather == "хмарно":
    print("ботинки,легка куртка,футболка по можливості шапка легенька,штани")
elif weather == "сніг":
    print("рукавиці теплі,футболка,тепла кофта,тепла шапка,теплі ботинки,теплі штани,шарф")
elif weather == "сніг":
    print("гумові ботинки,дощовик,футболка,кофта не дуже легка,курточка або вітровка")
else:
    print("незнаєте яка погода одягайтесь як ви відчуваєте")