wound = input("Мій ранок (восени,зимою весною та літом):")

if wound == "восени":
    print("Прокинувся зробив гігієнічні справи поїв надів футболку,кофту,спортивні штани,носочки,кросівки")
elif wound == "зимою":
    print("Прокинувся зробив гігієнічні справи попив чай поїв бутербродиків одягнув теплі речі якщо є сніг пішов "
          "з друзями грати в сніжки якщо нема то в центр кудись")
elif wound == "весною":
    print("Прокинувся зробив гігієнічні справи подивився в віконце яка красива погода як співають пташки перекусив "
          "перекусив досить легко вдівся та пішов на прогулянку)")
elif wound == "літом":
    print("Прокинувся зробив гігієнічні справи випив стакан прохолодної водички бо жарко зробив легенький перекусик "
          "подивитися на природу з віконця та піти на прогулянку ")
else:
    print("Невірний вибір.я прокинусь в обід хех)")
