print("Вітаємо вас в вікторині!")
score = 0

a = input("1.Яка столиця Канади? ")
if a == "Оттава":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")
a = ("2.Який самий найбільший океан?")

if a == "Тихий океан":

    print("Вірно.Ты молодець!")

    score += 1
else:

    print("Неправильно.Спробуй ще раз!")

a = input("3.Найбільший штат Америки?\nа) Аляска\nб) Каліфорнія\nв) Майамі\nВаш варіант: ")
if a == "Аляска":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")

a = input("3.Самий великий орган в людині?")
if a == "Шкіра":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")

a = input("4.Скільки буде 4+4*4 ")
if a == "20":
    print("Вірно.Ты молодець!")
    score += 1

else:
    print("Неправильно.Спробуй ще раз!")

a = input("5.Скільки треба вчитись в школі щоб її закінчити повністю?")
if a == "11":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")

a = input("6. Скільки областей в україні?")
if a == "24":
    print("Вірно.Ты молодець!")
    score += 1

else:
    print("Неправильно.Спробуй ще раз!")

a = input("7.Сама дорога картина в світ?\nа) Водяні змії II\nб) Леонардо да Вінчі\nв) гравці в карти\nВаш варіант:")
if a == "Леонардо да Вінчі":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")

a = input("8.Яка найпопулярніша мова програмування у світі?")
if a == "JavaScript":
    print("Вірно.Ты молодець!")
    score += 1

else:
    print("Неправильно.Спробуй ще раз!")

a = input("9.В якої мові самий легкий синтаксис?")
if a == "Python":
    print("Вірно.Ты молодець!")
    score += 1
else:
    print("Неправильно.Спробуй ще раз!")

a = input("10.Скільки гігабайт в 1 терабайті??")
if a == "1024":
    print("Вірно.Ты молодець!")
    score += 1
else:
    print("Неправильно.Спробуй ще раз!")
