print("Вітаємо вас у вікторині!")
print("Оберіть рівень складності:")
print("1 - Легкий\n2 - Середній\n3 - Складний")
level = input("Ваш вибір (1/2/3): ")

score = 0

if level == "1":
    # Легкий рівень
    a = input("1.Що таке змінна?\nа) Місце для зберігання даних\nб) Функція для друку тексту\nв)  Вид циклу\nВаш варіант: ")
    if a == "Місце для зберігання даних":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("2. Скільки буде 4+4*4?\nа) 32\nб) 20\nв) 64\nВаш варіант: ")
    if a == "20":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("3. Скільки гігабайтів в 1 терабайті?\nа) 1000\nб) 1024\nв) 1048\nВаш варіант: ")
    if a == "1024":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("4. Що робить цикл у програмуванні?\nа) Виконує код один раз\nб) Повторює блок коду кілька разів\nв) Зберігає дані у змінній\nВаш варіант: ")
    if a == "Повторює блок коду кілька разів":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input('5. Що виведе команда print("Hello.World!")?\nа) Hello, World!\nб) print("Hello, World!")\nв) Помилка\nВаш варіант: ')

    if a == " Hello, World!":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("6. Який символ використовується для коментарів у Python?\nа) //\nб) #\nв) /* */\nВаш варіант: ")
    if a == "#":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")
    a = input("7. Якою мовою програмування є Python?\nа) Машинна мова\nб)Високорівнева мова програмування\nв)  Мова розмітки\nВаш варіант: ")
    if a == "Високорівнева мова програмування":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("8. Що таке функція?\nа) Частина коду що виконує завдання\nб) Тип змінної\nв) Спеціальний цикл\nВаш варіант: ")
    if a == "Частина коду що виконує завдання":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("9. Який оператор використовують для додавання у Python?\nа) -\nб) +\nв) *\nВаш варіант: ")
    if a == "+":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("10. Скільки буде 10 / 2?\nа) 2\nб) 5\nв) 10\nВаш варіант: ")
    if a == "5":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

elif level == "2":
    #Средній рівень
    a = input("1. Що робить оператор elif в Python??\nа) Перевіряє іншу умову\nб) Починає цикл\nв) Оголошує функцію\nВаш варіант: ")
    if a == "Перевіряє іншу умову":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("2. Який результат буде у 3 == 3.0 у Python?\nа) False\nб) True\nв)  Помилка\nВаш варіант: ")
    if a == "True":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("3. Що робить оператор if?\nа) Створює змінну\nб) Виконує код за умови\nв) Запускає цикл\nВаш варіант: ")
    if a == "Виконує код за умови":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("4. Що робить оператор elif в Python?\n?а) Перевіряє додаткову умову \nб) Починає цикл\nв) Оголошує змінну\nВаш варіант: ")
    if a == "Перевіряє додаткову умову":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input('5. Що робить оператор \n в Python?\nа) Вертає текст назад\nб) Виводить пробіл\nв) Змінює колір тексту\nВаш варіант: ')
    if a == "Виводить пробіл":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("6.Що таке def у мові програмування Python?\nа) Ключове для створення змінної\nб) Ключове слово для визначення функції\nв) Ключове слово для імпорту бібліотеки\nВаш варіант: ")
    if a == "Ключове слово для визначення функції":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("7. Що означає оператор or у Python?\nа) Порівнює два значення на рівність\nб)  Повертає True, якщо хоча б один із виразів є істинним: ")
    if a == "Повертає True, якщо хоча б один із виразів є істинним":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("8. Яка столиця Італії?\nа) Дозволяє підключити модулі або бібліотеки\nб) Видаляє змінну з памʼяті\nв) Використовується для створення функції\nВаш варіант: ")
    if a == "Дозволяє підключити модулі або бібліотеки":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("9. Що таке ОЗУ??\nа) Постійна памʼять\nб) Тимчасова памʼять для роботи даних\nв) Пристрій для виводу\nВаш варіант: ")
    if a == "Тимчасова памʼять для роботи даних":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("10. Хто створив Facebook?\nа) Білл Гейтс\nб) Ілон Маск\nв) Марк Цукерберг\nВаш варіант: ")
    if a == "Марк Цукерберг":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")
#Складний рівень
elif level == "3":
    a = input("1. Яка мова програмування найбільш універсальна?\nа) Python\nб) HTML\nв) SQL\nВаш варіант: ")
    if a == "Python":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("2.Що таке None у Python?\nа) Число 0\nб) Порожнє значення\nв) Тип рядка\nВаш варіант: ")
    if a == "Порожнє значення":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("3. Що означає 'CPU'?\nа) Central Power Unit\nб) Central Processing Unit\nв) Control Panel Unit\nВаш варіант: ")
    if a == "Central Processing Unit":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("4. Яка найменша одиниця інформації?\nа) Байт\nб) Кілобайт\nв) Біт\nВаш варіант: ")
    if a == "Біт":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("5. Як називається мова яка працює в браузері?\nа) C++\nб) JavaScript\nв) Python\nВаш варіант: ")
    if a == "JavaScript":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("6. Що таке HTML?\nа) Мова стилів\nб) Мова розмітки\nв) Мова баз даних\nВаш варіант: ")
    if a == "Мова розмітки":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("7. Що означає IDE?\nа) Integrated Development Environment\nб) Internet Device Emulator\nв) Interactive Design Editor\nВаш варіант: ")
    if a == "Integrated Development Environment":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")


    a = input("9. Для чого треба Github?\nа) Hacking\nб)Зберігання спільної роботи з кодом\nв) Щоб переписуватися\nВаш варіант: ")
    if a == "Зберігання спільної роботи з кодом":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("10. Що таке Git?\nа) Система контролю версій\nб) Браузер\nв) Редактор коду\nВаш варіант: ")
    if a == "Система контролю версій":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

else:
    print("Невірний вибір рівня. Спробуйте перезапустити вікторину.")

print("Ваш рахунок:", score)

