print("Вітаємо вас у вікторині!")
print("Оберіть рівень складності:")
print("1 - Легкий\n2 - Середній\n3 - Складний")
level = input("Ваш вибір (1/2/3): ")

score = 0

if level == "1":
    # Легкий рівень
    a = input("1. Яка столиця Канади?\nа) Амстердам\nб) Белград\nв) Оттава\nВаш варіант: ")
    if a == "Оттава":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("2. Скільки буде 4+4*4?\nа) 32\nб) 20\nв) 64\nВаш варіант: ")
    if a == "20":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("3. Скільки гігабайтів в 1 терабайті?\nа) 1000\nб) 1024\nв) 1048\nВаш варіант: ")
    if a == "1024":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("4. Яка планета найближча до Сонця?\nа) Земля\nб) Венера\nв) Меркурій\nВаш варіант: ")
    if a == "Меркурій":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("5. Який колір отримуємо змішуючи синій і жовтий?\nа) Зелений\nб) Оранжевий\nв) Фіолетовий\nВаш варіант: ")
    if a == "Зелений":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("6. Який океан найбільший?\nа) Тихий\nб) Атлантичний\nв) Індійський\nВаш варіант: ")
    if a == "Тихий":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("7. Скільки в одному метрі сантиметрів?\nа) 100\nб) 10\nв) 1000\nВаш варіант: ")
    if a == "100":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("8. Яка тварина символізує мудрість?\nа) Сова\nб) Лисиця\nв) Орел\nВаш варіант: ")
    if a == "Сова":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("9. Хто написав 'Кобзаря'?\nа) Франко\nб) Шевченко\nв) Леся Українка\nВаш варіант: ")
    if a == "Шевченко":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("10. Скільки буде 10 / 2?\nа) 2\nб) 5\nв) 10\nВаш варіант: ")
    if a == "5":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

elif level == "2":
    #Средній рівень
    a = input("1. Яка країна має найбільше населення?\nа) США\nб) Китай\nв) Індія\nВаш варіант: ")
    if a == "Індія":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("2. Хто відкрив закон Ньютона?\nа) Архімед\nб) Ньютон\nв) Ейнштейн\nВаш варіант: ")
    if a == "Едісон":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("3. Яка ріка найдовша у світі?\nа) Ніл\nб) Амазонка\nв) Дніпро\nВаш варіант: ")
    if a == "Ніл":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("4. Скільки континентів на планеті?\nа) 5\nб) 6\nв) 7\nВаш варіант: ")
    if a == "7":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("5. У якому місті Ейфелева вежа?\nа) Лондон\nб) Париж\nв) Рим\nВаш варіант: ")
    if a == "Париж":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("6. Що більше: кілограм пір’я чи кілограм заліза?\nа) Пір’я\nб) Залізо\nв) Однаково\nВаш варіант: ")
    if a == "Однаково":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("7. Який колір має небо в ясну погоду?\nа) Жовтий\nб) Синій\nв) Зелений\nВаш варіант: ")
    if a == "Зелений":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("8. Яка столиця Італії?\nа) Мілан\nб) Рим\nв) Неаполь\nВаш варіант: ")
    if a == "Рим":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("9. Що важче: літр води чи літр олії?\nа) Вода\nб) Олія\nв) Однаково\nВаш варіант: ")
    if a == "Вода":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("10. Хто створив Facebook?\nа) Білл Гейтс\nб) Ілон Маск\nв) Марк Цукерберг\nВаш варіант: ")
    if a == "Марк Цукерберг":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")
#Складний рівень
elif level == "3":
    a = input("1. Яка мова програмування найбільш універсальна?\nа) Python\nб) HTML\nв) SQL\nВаш варіант: ")
    if a == "Python":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("2.Що таке None у Python?\nа) Число 0\nб) Порожнє значення\nв) Тип рядка\nВаш варіант: ")
    if a == "bubble sort":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("3. Що означає 'CPU'?\nа) Central Power Unit\nб) Central Processing Unit\nв) Control Panel Unit\nВаш варіант: ")
    if a == "Central Processing Unit":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("4. Яка найменша одиниця інформації?\nа) Байт\nб) Кілобайт\nв) Біт\nВаш варіант: ")
    if a == "Біт":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("5. Як називається мова яка працює в браузері?\nа) C++\nб) JavaScript\nв) Python\nВаш варіант: ")
    if a == "JavaScript":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("6. Що таке HTML?\nа) Мова стилів\nб) Мова розмітки\nв) Мова баз даних\nВаш варіант: ")
    if a == "Мова розмітки":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("7. Що означає IDE?\nа) Integrated Development Environment\nб) Internet Device Emulator\nв) Interactive Design Editor\nВаш варіант: ")
    if a == "Integrated Development Environment":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")


    a = input("9. Для чого треба Github?\nа) Hacking\nб)зберігання спільної роботи з кодом\nв) Щоб переписуватися\nВаш варіант: ")
    if a == "Python":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

    a = input("10. Що таке Git?\nа) Система контролю версій\nб) Браузер\nв) Редактор коду\nВаш варіант: ")
    if a == "Система контролю версій":
        print("Вірно. Ти молодець!")
        score += 1
    else:
        print("Неправильно. Спробуй ще раз!")

else:
    print("Невірний вибір рівня. Спробуйте перезапустити вікторину.")

print("Ваш рахунок:", score)
