print("Вітаємо вас в вікторині!")
score = 0

a = input("1.Яка столиця Канади?\nа) Амстердам\nб) Белград\nв) Оттава\nВаш варіант: ")
if a == "Оттава":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")
a = input("2.Який найбільший океан?\nа) Атлантичний океан\nб) Тихий океан\nв) Індійський океан\nВаш варіант: ")
if a == "Тихий океан":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")

a = input("3.Найбільший штат Америки?\nа) Аляска\nб) Каліфорнія\nв) Флорида\nВаш варіант: ")
if a == "Аляска":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")

a = input("3.Самий великий орган в людині?\nа) Сердце\nб) Легені\nв) Шкіра\nВаш варіант: ")
if a == "Шкіра":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")

a = input("4.Скільки буде 4+4*4?\nа) 32\nб) 20\nв) 64\nВаш варіант: ")
if a == "20":
    print("Вірно.Ты молодець!")
    score += 1

else:
    print("Неправильно.Спробуй ще раз!")

a = input("5.Скільки треба вчитись в школі щоб її закінчити повністю?\nа) 8\nб) 12\nв) 11\nВаш варіант: ")
if a == "11":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")

a = input("6. Скільки областей в україні?\nа) 24\nб) 21\nв) 18\nВаш варіант: ")
if a == "24":
    print("Вірно.Ты молодець!")
    score += 1

else:
    print("Неправильно.Спробуй ще раз!")

a = input("7.Сама дорога картина в світ?\nа) Водяні змії II\nб) Леонардо да Вінчі\nв) гравці в карти\nВаш варіант: ")
if a == "Леонардо да Вінчі":
    print("Вірно.Ты молодець!")
    score += 1

else:

    print("Неправильно.Спробуй ще раз!")

a = input("8.Яка найпопулярніша мова програмування у світі?\nа) JavaScript\nб) TypeScript\nв) C++\nВаш варіант: ")
if a == "JavaScript":
    print("Вірно.Ты молодець!")
    score += 1

else:
    print("Неправильно.Спробуй ще раз!")

a = input("9.В якої мові самий легкий синтаксис?\nа) JavaScript\nб) Python\nв) Assembler\nВаш варіант: ")
if a == "Python":
    print("Вірно.Ты молодець!")
    score += 1
else:
    print("Неправильно.Спробуй ще раз!")

a = input("10.Скільки гігабайт в 1 терабайті?\nа) 1000\nб) 1024\nв) 1048\nВаш варіант: ")
if a == "1024":
    print("Вірно.Ты молодець!")
    score += 1
else:
    print("Неправильно.Спробуй ще раз!")
